kmkim036/Auto-Headlight-Control-System/src/example/yLib/eth/stm32f1x7_eth_bsp.c
/**
  ******************************************************************************
  * @file    stm32f1x7_eth_bsp.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    31-October-2011 
  * @brief   STM32F1x7 Ethernet hardware configuration.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>

  *  BROADR-Reach BCM89810 Driver
  *  PHYADDR = 0x18
  *  NORMAL MII Mode
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
 #include <stdint.h>
#include "yLib/eth/include/ethopts.h"//#include "lwip/include/lwipopts.h"
#include "yInc.h"
#if (PROCESSOR == PROCESSOR_STM32F107VCT)
#include "cmsis_boot/stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_i2c.h"
#include "stm32f10x_spi.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
#include "stm32f10x_exti.h"
#include "stm32f10x_tim.h"
#include "stm32f107_eth.h"
#include "misc.h"
#include "cmdline.h"
#include "core_cm3.h"
#include "yLib/eth/include/stm32f1x7_eth_bsp.h"
//#include "lwip/include/ip_addr.h"
//#include "netconf.h"
#include "yLib/eth/include/ethernetif.h" //#include "lwip/include/ethernetif.h"
#include "err.h"
//#include "lwip/include/lwipmain.h"

__IO uint32_t  gEthInitStatus = 0;
__IO uint8_t EthLinkStatus = 0;
__IO uint32_t EthStatus = 0; //Add YOON -- NOT USED ANY..
extern unsigned char g_ip_addr3;//

/* Private function prototypes -----------------------------------------------*/
void ETH_GPIO_Config(void);
void ETH_NVIC_Config(void);
void ETH_MACDMA_Config(unsigned short PHYAddr);
extern struct netif g_netif;

//+-----------------+-----------+-----------+---------+
//| TJA1100         | 407-M35   | 407-M36   |407VZT   |
//+-----------------+-----------+-----------+-----------+---------+---------+
//| ULED            |PE15       | <==       | PG7
//+-----------------+-----------+-----------+-----------+---------+---------+
//| BUTTON          |PD11(index)| PD11(L)   |
//+-----------------+-----------+-----------+-----------+---------+
//| BEEP            |PD14       | <==       |
//+-----------------+-----------+-----------+-----------+---------+
//| ChipEnalbe      |PE14(DNI)  |<==
//+-----------------+-----------+-----------+-----------+---------+
//| nIRQ            |PA3        |<==
//+-----------------+-----------+-----------+-----------+---------+
//| M/S Select      |PE1        |<==
//+-----------------+-----------+-----------+-----------+---------+
//| FORCE/AN        |PE3        |<==
//+-----------------+-----------+-----------+-----------+---------+
//| MCO1            |PA8        |<==
//+-----------------+-----------+-----------+-----------+---------+

/**
  * @brief  Configures the nested vectored interrupt controller.
  */
void ETH_NVIC_Config(void)
{
  NVIC_InitTypeDef   NVIC_InitStructure;

  /* Set the Vector Table base location at 0x08000000 */
  //NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);

  /* 2 bit for pre-emption priority, 2 bits for subpriority */
  //NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
  NVIC_DisableIRQ(ETH_IRQn);
  // Enable the Ethernet global Interrupt
  NVIC_InitStructure.NVIC_IRQChannel = ETH_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  NVIC_EnableIRQ(ETH_IRQn);

}

#if (ETH_IF_MODE != ETH_IF_SPI_MODE)
void ETH_GPIO_Config(void) //void stm32f107EthInitGpio(void) //NetInterface *interface)
{

	 /**
	  * @brief GPIO configuration
	  * @param[in] interface Underlying network interface
	  **/
	 /*
	         ETH_MDIO -------------------------> PA2 +
	         ETH_MDC --------------------------> PC1 +
	         ETH_PPS_OUT ----------------------> PB5 --- STM32 PPS
	         -ETH_MII_CRS ----------------------> PA0  -- Dont cared by MAC for Full Duplex Mode.
	         -ETH_MII_COL ----------------------> PA3  -- Dont cared by MAC for Full Duplex Mode.
	         -ETH_MII_RX_ER --------------------> PB10
	         ETH_MII_RXD2 ---------------------> PB0
	         ETH_MII_RXD3 ---------------------> PB1
	         ETH_MII_TX_CLK -------------------> PC3 +
	         ETH_MII_TXD2 ---------------------> PC2 +
	         ETH_MII_TXD3 ---------------------> PB8(STM32F107) //PE2
	         ETH_MII_RX_CLK/ETH_RMII_REF_CLK---> PA1 +
	         ETH_MII_RX_DV/ETH_RMII_CRS_DV ----> PA7 +
	         ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4 +
	         ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5 +
	         ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PB11
	         ETH_MII_TXD0/ETH_RMII_TXD0 -------> PB12
	         ETH_MII_TXD1/ETH_RMII_TXD1 -------> PB13

	         -nPHYRESET ------------------------> PC8 (NOT USED)
	                                                   */
	    GPIO_InitTypeDef GPIO_InitStructure;

	    //Enable AFIO clock
	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

	    //Enable GPIO clocks
	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB |
	       RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD, ENABLE);

	    //Configure MCO (PA8) as an output
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	    GPIO_Init(GPIOA, &GPIO_InitStructure);

	#if (ETH_IF_MODE == ETH_IF_MII_MODE) //ETH_IF_RMII_MODE

	    //Configure MCO pin to output the HSE clock (25MHz)
	    RCC_MCOConfig(RCC_MCO_HSE);

	    //Select MII interface mode
	    GPIO_ETH_MediaInterfaceConfig(GPIO_ETH_MediaInterface_MII);

	#elif (ETH_IF_MODE == ETH_IF_RMII_MODE)
	    //Configure PLL3 to output a 50MHz clock
	    RCC_PLL3Config(RCC_PLL3Mul_10);
	    //Enable PLL3
	    RCC_PLL3Cmd(ENABLE);

