kmkim036/Auto-Headlight-Control-System/src/example/yLib/eth/stm32f1x7_eth_bsp.c
	    //Wait for the PLL3 to lock
	    while(RCC_GetFlagStatus(RCC_FLAG_PLL3RDY) == RESET);

	    //Configure MCO pin to output the PLL3 clock
	    RCC_MCOConfig(RCC_MCO_PLL3CLK);

	    //Select RMII interface mode
	    GPIO_ETH_MediaInterfaceConfig(GPIO_ETH_MediaInterface_RMII);
	#endif

	    //Configure MII_MDIO (PA2) - AF Output Push Pull
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	    GPIO_Init(GPIOA, &GPIO_InitStructure);

	    //Configure MII_PPS_OUT (PB5), ETH_MII_TXD3 (PB8), MII_TX_EN (PB11),
	    //MII_TXD0 (PB12) and MII_TXD1 (PB13) - AF Output Push Pull
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_8 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	    GPIO_Init(GPIOB, &GPIO_InitStructure);

		GPIO_PinRemapConfig(GPIO_Remap_PTP_PPS, ENABLE);//YOON : Added for STM32F107VCT .. PB5 PPS

	    //Configure MII_MDC (PC1) and MII_TXD2 (PC2) - AF Output Push Pull
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	    GPIO_Init(GPIOC, &GPIO_InitStructure);

	    //--- INPUT --------

	    //Configure ETH_MII_TX_CLK (PC3) -- INPUT
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; //GPIO_Mode_AF_PP;
	    GPIO_Init(GPIOC, &GPIO_InitStructure);

	    // RX - INPUT
	    //Configure
	    //ETH_MII_RXD0 (PC4),
	    //ETH_MII_RXD1 (PC5),
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	    GPIO_Init(GPIOC, &GPIO_InitStructure);

	    //ETH_MII_RXD2 (PB0)
	    //ETH_MII_RXD3 (PB1)
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	    GPIO_Init(GPIOB, &GPIO_InitStructure);

	    //Configure
	    //ETH_MII_CRS (PA0)-- X
	    //ETH_MII_RX_CLK (PA1)
	    //ETH_MII_COL (PA3) -- X
	    //ETH_MII_RX_DV (PA7),
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_7; //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_3;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	    GPIO_Init(GPIOA, &GPIO_InitStructure);

	    //Configure ETH_MII_RX_ER (PB10)
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	    GPIO_Init(GPIOB, &GPIO_InitStructure);

	    //Remap Ethernet pins (No need for remap)
	    GPIO_PinRemapConfig(GPIO_Remap_ETH, DISABLE);

	    delayms(100);
}
#elif (ETH_IF_MODE == ETH_IF_SPI_MODE)
void ETH_GPIO_Config_WO_MDIOMDC(void) //For KSZ Switches... Those are controlled with not MDIO/MDC but SPI.
{
	GPIO_InitTypeDef GPIO_InitStructure;

	// Enable GPIO clocks
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOE,  ENABLE);

	//Enable SysCfg Clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	/*
	// Configure nRESETPHY (PC8). Issue nPHY_RESET
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	//GPIO_ResetBits(GPIOC, GPIO_Pin_8);//SET MII mode while in RESET ????
	*/

  /* MII/RMII Media interface selection ---PTP
   * -----------------------------------*/

#if (MII_RMII == MII_MODE)
  //Select MII mode : Setting mode is allowed under reset or before enabling MAC clocks.
/*
#ifdef USE_MCO1_FOR_PHY_CLOCK_SRC
   // Output HSE clock (25MHz) on MCO pin (PA8) to clock the PHY
	MCO1_Config_25MHz();
	printf("***Using MCO1 25MHz Output ***\r\n");
#endif
*/
  //Select MII mode : Setting mode is allowed under reset or before enabling MAC clocks.
  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_MII); //0 = MII/ 1= RMII
  printf("***MII***\r\n");

#elif (MII_RMII == RMII_MODE)  /* Mode RMII with STM324xG-EVAL */
//#error using RMII_MODE !!!!!
  	  /* Output PLL clock divided by 2 (50MHz) on MCO pin (PA8) to clock the PHY */
  	  //RCC_MCO1Config(RCC_MCO1Source_PLLCLK, RCC_MCO1Div_2);
  	  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_RMII);
  	printf("***RMII***\r\n");
#endif

  delayms(800);
  //GPIO_SetBits(GPIOC, GPIO_Pin_8); //nRESET_PHY TO HIGH
  //delayms(10);

/* Ethernet pins configuration (YOON)************************************************/
   /*
        ETH_MDIO -------------------------> PA2 +
        ETH_MDC --------------------------> PC1 +
        ETH_PPS_OUT ----------------------> PB5 --- STM32 PPS
        -ETH_MII_CRS ----------------------> PA0  -- Dont cared by MAC for Full Duplex Mode.
        -ETH_MII_COL ----------------------> PA3  -- Dont cared by MAC for Full Duplex Mode.
        -ETH_MII_RX_ER --------------------> PB10
        ETH_MII_RXD2 ---------------------> PB0
        ETH_MII_RXD3 ---------------------> PB1
        ETH_MII_TX_CLK -------------------> PC3 +
        ETH_MII_TXD2 ---------------------> PC2 +
        ETH_MII_TXD3 ---------------------> PE2 //PB8 +
        ETH_MII_RX_CLK/ETH_RMII_REF_CLK---> PA1 +
        ETH_MII_RX_DV/ETH_RMII_CRS_DV ----> PA7 +
        ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4 +
        ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5 +
        ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PB11
        ETH_MII_TXD0/ETH_RMII_TXD0 -------> PB12
        ETH_MII_TXD1/ETH_RMII_TXD1 -------> PB13

        -nPHYRESET ------------------------> PC8 (NOT USED)
                                                  */
  /* Enable GPIOs clocks for Ethernet */
  // Configure PA1, PA2(MDIO), and PA7
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //?? NO GPIO_OType_AF
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_7; //exclude MDIO
  //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2  | GPIO_Pin_7;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_ETH);
  //GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_ETH); //MDIO
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_ETH);

