kmkim036/Auto-Headlight-Control-System/src/example/yLib/eth/stm32f1x7_eth_bsp.c
  //Continue... Configure PB0,PB1,PB5,PB11,PB12 and PB13
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 |GPIO_Pin_1 | GPIO_Pin_11  | GPIO_Pin_12 |  GPIO_Pin_13;  //exclude PB5 PPS
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_PinAFConfig(GPIOB, GPIO_PinSource0, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource1, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource12, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_ETH);

  //In addition for PPS
  ////For LAN9355, We disable PPS Function of STM32F407. The PIN PB5 will be used for PPS output with GPIO OUTPUT which is driven by LAN9355's 1588 Event Trigger.
//#if (SWITCH_ID == SWITCH_LAN9355)
//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 ;  //PB5 PPS
//  GPIO_Init(GPIOB, &GPIO_InitStructure);
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
//#else
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 ;  //PB5 PPS
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource5, GPIO_AF_ETH); //PPS - The PPS output is enabled through a GPIO alternate function. (GPIO_AFR register).
//#endif

  //Continue... Configure PC1(MDC), PC2, PC3, PC4 and PC5
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5; //exclude MDC
  //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  //GPIO_PinAFConfig(GPIOC, GPIO_PinSource1, GPIO_AF_ETH); //MDC
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource2, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource3, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource4, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_ETH);

  /* Configure PE2 (for TXD3) */
  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_2;
  GPIO_Init(GPIOE, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource2, GPIO_AF_ETH);

  delayms(800);

}
#endif

void ETH_MACDMA_Config(unsigned short PHYAddress)
{
	ETH_InitTypeDef ETH_InitStructure;
	//After GPIO Config, we start MAC Clocking
#if USE_MCU_PTP
  //RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ETH_MAC | RCC_AHBPeriph_ETH_MAC_Tx | RCC_AHBPeriph_ETH_MAC_Rx | RCC_AHBPeriph_ETH_MAC_PTP, ENABLE); //PTP Support case
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ETH_MAC | RCC_AHBPeriph_ETH_MAC_Tx | RCC_AHBPeriph_ETH_MAC_Rx, ENABLE); //PTP Support case --- 107
#else
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ETH_MAC | RCC_AHBPeriph_ETH_MAC_Tx | RCC_AHBPeriph_ETH_MAC_Rx, ENABLE);
#endif
  delayms(10); //should be ...

  /* Reset ETHERNET on AHB Bus */
  ETH_DeInit(); //Deinitializes the ETHERNET peripheral registers to their default reset values.

  //If not working, comment out.
  ETH_SoftwareReset(); //resets all MAC subsystem internal registers and logic
  while (ETH_GetSoftwareResetStatus() == SET); //Never return 0. YOON....

  // ETHERNET Configuration ===============
  ETH_StructInit(&ETH_InitStructure);

  // Fill several interesting ETH_InitStructure parameters
  ETH_InitStructure.ETH_AutoNegotiation 			= ETH_AutoNegotiation_Disable;//Critical - SHould be Disabled for test. ETH_AutoNegotiation_Enable;// ETH_AutoNegotiation_Disable;
  ETH_InitStructure.ETH_Speed 						= ETH_Speed_100M;
  ETH_InitStructure.ETH_InterFrameGap 				= ETH_InterFrameGap_96Bit; //Added
  ETH_InitStructure.ETH_ReceiveOwn 					= ETH_ReceiveOwn_Disable; //ETH_ReceiveOwn_Enable; //Added for 10Mbps
  ETH_InitStructure.ETH_Mode 						= ETH_Mode_FullDuplex;
  ETH_InitStructure.ETH_CarrierSense 				= ETH_CarrierSense_Disable; //YOON : VERY CRITICAL
  ETH_InitStructure.ETH_LoopbackMode 				= ETH_LoopbackMode_Disable;//ETH_LoopbackMode_Enable;// Need RXCLK for Loopback.
  ETH_InitStructure.ETH_RetryTransmission 			= ETH_RetryTransmission_Disable;
  ETH_InitStructure.ETH_AutomaticPadCRCStrip 		= ETH_AutomaticPadCRCStrip_Disable;//Enable;
  ETH_InitStructure.ETH_ReceiveAll 					= ETH_ReceiveAll_Enable; //Unicast and Multicast Frames. Promiscuous Mode?
  ETH_InitStructure.ETH_BroadcastFramesReception 	= ETH_BroadcastFramesReception_Enable;
  ETH_InitStructure.ETH_PromiscuousMode 			= ETH_PromiscuousMode_Enable;//YOON : VERY CRITICAL FOR MULTICAST
  ETH_InitStructure.ETH_MulticastFramesFilter 		= ETH_MulticastFramesFilter_None;//ETH_MulticastFramesFilter_Perfect;
  ETH_InitStructure.ETH_UnicastFramesFilter 		= ETH_UnicastFramesFilter_Perfect;
  ETH_InitStructure.ETH_VLANTagComparison 			= ETH_VLANTagComparison_16Bit;
  ETH_InitStructure.ETH_VLANTagIdentifier 			= 0x00;//NO.    0x02; //For AVB

#ifdef CHECKSUM_BY_HARDWARE
  ETH_InitStructure.ETH_ChecksumOffload = ETH_ChecksumOffload_Enable;
#endif

  /*------------------------   DMA   -----------------------------------*/
  /* When we use the Checksum offload feature, we need to enable the Store and Forward mode:
  the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can insert/verify the checksum,
  if the checksum is OK the DMA can handle the frame otherwise the frame is dropped */
  ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Disable;//ETH_DropTCPIPChecksumErrorFrame_Enable;
  ETH_InitStructure.ETH_ReceiveStoreForward 		= ETH_ReceiveStoreForward_Disable;//ETH_ReceiveStoreForward_Enable;
  ETH_InitStructure.ETH_TransmitStoreForward 		= ETH_TransmitStoreForward_Disable;//ETH_TransmitStoreForward_Enable;
  ETH_InitStructure.ETH_ForwardErrorFrames 			= ETH_ForwardErrorFrames_Disable;
  ETH_InitStructure.ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Enable;//Disable;
  ETH_InitStructure.ETH_SecondFrameOperate 			= ETH_SecondFrameOperate_Enable;
  ETH_InitStructure.ETH_AddressAlignedBeats 		= ETH_AddressAlignedBeats_Enable;
  ETH_InitStructure.ETH_FixedBurst 					= ETH_FixedBurst_Enable;
  ETH_InitStructure.ETH_RxDMABurstLength 			= ETH_RxDMABurstLength_8Beat;//ETH_RxDMABurstLength_32Beat;//ETH_RxDMABurstLength_8Beat;//ETH_RxDMABurstLength_32Beat;
  ETH_InitStructure.ETH_TxDMABurstLength 			= ETH_RxDMABurstLength_8Beat;//ETH_TxDMABurstLength_32Beat;//ETH_RxDMABurstLength_8Beat;//ETH_TxDMABurstLength_32Beat;
  ETH_InitStructure.ETH_DMAArbitration 				= ETH_DMAArbitration_RoundRobin_RxTx_2_1;//ETH_DMAArbitration_RoundRobin_RxTx_1_1;//ETH_DMAArbitration_RoundRobin_RxTx_2_1;
  ETH_InitStructure.ETH_DescriptorSkipLength 		= 0x0;// Added
  gEthInitStatus = ETH_Init(&ETH_InitStructure, PHYAddress);//IP101A_PHY_ADDRESS);//BROADR_PHY_ADDRESS);//IP101A_PHY_ADDRESS);//was KSZ8051_PHY_ADDRESS);

  //Disable MAC Interrupt(TimeStamp and P...)
  //ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R | ETH_DMA_IT_T, DISABLE); //NIS=Normal interrupt summary; IT_R=Receive interrupt; T=Tx Interrupt(YOON add)

