kmkim036/Auto-Headlight-Control-System/src/example/yLib/eth/stm32f1x7_eth_bsp.c
  // Enable the the RX DMA Interrupts
  ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R , ENABLE); //NIS=Normal interrupt summary; IT_R=Receive interrupt; T=Tx Interrupt(YOON add)

  //ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R | ETH_DMA_IT_T , ENABLE); //NIS=Normal interrupt summary; IT_R=Receive interrupt; T=Tx Interrupt(YOON add)
  //ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R | ETH_DMA_IT_T | ETH_DMA_IT_TBU, ENABLE); //NIS=Normal interrupt summary; IT_R=Receive interrupt; T=Tx Interrupt(YOON add)

  printf("ETH_MACDMA_Config Pass\r\n");
}
//==PHY DEPENDENT ===================================================
#if (PHYCHIP == TJA1100) //and others(PHY Mode Switches)
void ETH_TJA1100_BSP_Config(void) --> Consolidated in void ETH_X_BSP_Config(unsigned char PhyAddr)
#elif (PHYCHIP == RTL9K) //and others(PHY Mode Switches)
void ETH_RTL9K_BSP_Config(void) -->  Consolidated in void ETH_X_BSP_Config(unsigned char PhyAddr)
#else //and others(PHY Mode Switches) ==============================================================================
void ETH_X_BSP_Config(unsigned char PhyAddr, char *str)
{
	int i;
	uint16_t retv;
	unsigned int result;

	printf("%s Config\r\n",str);

	//(1) GPIO and MCO1 configuration
	ETH_GPIO_Config();

	//(2) Config Ethernet MAC interrupts
	ETH_NVIC_Config();

	//(3) Configure the Ethernet peripheral and DMA
	ETH_MACDMA_Config(PhyAddr);

	printf("ETH_MACDMA_Config...ok \r\n");
	printf("EthInitStatus: %d\r\n",gEthInitStatus);
	delayms(10);

	if (gEthInitStatus == 0) {
		while(1){
	    	printf("EthInitStatus=0 --> Error\r\n"); delayms(100);
		}
	 }else
		  printf("ok\r\n");

	 //(4) Get PHY Product ID
	 // Read PHY ID register2 and 3: Should be 0x0180 and 0xdc48
	 retv = ETH_ReadPHYRegister(PhyAddr, 0x02);
	 printf("PHYID Reg2 = 0x%04x and ",retv);

	 retv = ETH_ReadPHYRegister(PhyAddr, 0x03);
	 printf("PHYID Reg3 = 0x%04x \r\n",retv);

	 // Read PHY status register: Get Ethernet link status
	 retv = ETH_ReadPHYRegister(PhyAddr, 0x01);
	 if(retv & 0x04)  { //LRE Status Register(01:2) == 1-> Link UP
		 EthLinkStatus |= ETH_LINK_FLAG;  //EthStatus |= ETH_LINK_FLAG;
	 }

	 //(5) Walk through PHY Registers with SPI or I2C
	 for(i=0;i<16;i++){
		retv = ETH_ReadPHYRegister(PhyAddr, i);
		printf("ret(%d)=0x%04x\r\n",i,retv);
		delayms(10);
	 }

	 printf("ETH_BSP_Config --> PASSED\r\n");
}

#endif // ==============================================================================
#if 0
/**
 * @brief Receive a packet
 * @param[in] interface Underlying network interface
 * @return Error code
 **/
extern int rxnum;
//ethernetif_low_level_input_VerySimple(){//
err_t stm107_EthReceivePacket()//NetInterface *interface)
{

   err_t error;
   int len;
   unsigned char *frame;

   printf("R>\r\n");


   if (ETH_CheckFrameReceived())   {// process received ethernet packet
   			printf("=====main: ETH_CheckFrameReceived\r\n");
   			//seq++;
   			//LwIP_Pkt_Handle(); //move FIFO into pbuf, and handles it.
   			ETH_DMAClearITPendingBit(ETH_DMA_IT_R);
   			ETH_DMAClearITPendingBit(ETH_DMA_IT_NIS);
   	}

/*
   //The current buffer is available for reading?
   if(!(rxCurDmaDesc->rdes0 & ETH_RDES0_OWN))
   {
      //FS and LS flags should be set
      if((rxCurDmaDesc->rdes0 & ETH_RDES0_FS) && (rxCurDmaDesc->rdes0 & ETH_RDES0_LS))
      {
         //Make sure no error occurred
         if(!(rxCurDmaDesc->rdes0 & ETH_RDES0_ES))
         {
            //Retrieve the length of the frame
            len = (rxCurDmaDesc->rdes0 & ETH_RDES0_FL) >> 16;

            //Limit the number of data to read
            len = (len > ETH_RX_BUFFER_SIZE) ? ETH_RX_BUFFER_SIZE : len;
            frame = (uint8_t *) rxCurDmaDesc->rdes2;

            //Pass the packet to the upper layer
            //nicProcessPacket(interface, (uint8_t *) rxCurDmaDesc->rdes2, n);
            printf("R>Type=%02x%02x(%d)",frame[12], frame[13],rxnum);
            //printf("%s\r\n", str);
            rxnum++;
            //Valid packet received
            error = ERR_OK;
         }
         else
         {
            //The received packet contains an error
            error = ERR_INVALID_PACKET;
         }
      }
      else
      {
         //The packet is not valid
         error = ERR_INVALID_PACKET;
      }

      //Give the ownership of the descriptor back to the DMA
      rxCurDmaDesc->rdes0 = ETH_RDES0_OWN;
      //Point to the next descriptor in the list
      rxCurDmaDesc = (Stm32f107RxDmaDesc *) rxCurDmaDesc->rdes3;
   }
   else
   {
      //No more data in the receive buffer
      error = ERR_BUFFER_EMPTY;
   }

   //Clear RBUS flag to resume processing
   ETH->DMASR = ETH_DMASR_RBUS;
   //Instruct the DMA to poll the receive descriptor list
   ETH->DMARPDR = 0;
*/
   //Return status code
   return error;
}
#endif

bool g_TargetTimeReached= 0;

//=================For STM, any received frame will be served in this IRQ Handler ====
extern uint8_t g_rstp_Rx_Buff[ETH_RX_BUF_SIZE];
extern unsigned short rstp_eth_input(u8 *prxbuf);//extern unsigned short eth_input_withRxbuf(u8 *rxbuf);

void ETH_IRQHandler( void )
{
#ifdef USE_TARGETTIME
	if( SET == ETH_GetMACITStatus(ETH_MAC_IT_TST)){
		g_TargetTimeReached = 1;
	}
#endif

	//Read DMA Status register MDASR
    if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_R )){

    	//Disable RIE Interrupt
    	//ETH->DMAIER &= ~ETH_DMAIER_RIE;

		while (ETH_CheckFrameReceived())   {// check if any packet received
#if (ETHIF_ROLE == SIMPLE_ETH)
			printf("---EthIRQ\r\n");
			//Appropriate Handler
	#if (PROJ_FOR == PROJ_FOR_EDU)
			ethernetif_low_level_input_VerySimple();
	#elif (PROJ_FOR == PROJ_FOR_RSTP)
			rstp_eth_input(g_rstp_Rx_Buff);
	#endif

#else
			//printf("R ");
   			//ETH_DMAClearITPendingBit(ETH_DMA_IT_R);
   			//ETH_DMAClearITPendingBit(ETH_DMA_IT_NIS);

   			//ethernetif_low_level_input_VerySimple();

			LwIP_Pkt_Handle(); //avb_ethernetif_input()//move FIFO into pbuf, and handles it.
#endif
		}//while
        ETH_DMAClearITPendingBit( ETH_DMA_IT_R );    //Clear the Eth DMA Rx IT pending bits
    }//if

    if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_T ) ){
        ETH_DMAClearITPendingBit( ETH_DMA_IT_T);
    }

    if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_NIS ) ){ //Normal interrupt summary
        ETH_DMAClearITPendingBit( ETH_DMA_IT_NIS);
    }

