kmkim036/Auto-Headlight-Control-System/src/example/yLib/eth/stm32f1x7_eth_bsp.c
    //ETH_DMAClearITPendingBit( ETH_DMA_IT_R | ETH_DMA_IT_T | ETH_DMA_IT_NIS);    // Clear the Eth DMA Rx IT pending bits
    //Bit 16 NIS: Normal interrupt summary. The normal interrupt summary bit value is the logical OR of the following when the
	//	corresponding interrupt bits are enabled in the ETH_DMAIER register:
	//	?ETH_DMASR [0]: Transmit interrupt
	//	?ETH_DMASR [2]: Transmit buffer unavailable
	//	?ETH_DMASR [6]: Receive interrupt
	//	?ETH_DMASR [14]: Early receive interrupt
	//	Only unmasked bits affect the normal interrupt summary bit. This is a sticky bit and it must be cleared (by writing a 1 to this bit) each time a corresponding
	//	Bit 16 is only reset in ETH_IRQHandler and ETH_IRQHandler never being executed.
    //

    //if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_TBU ) ) {//YOON
    	//ETH_SetDMATxDescOwnBit(gp_DMATxDescToSet);
        //ETH_DMAClearITPendingBit( ETH_DMA_IT_TBU);
        //printf("---TBU_IRQ");
    //}

}


/*
void ETH_IRQHandler( void )
{

#ifdef USE_TARGETTIME
	if( SET == ETH_GetMACITStatus(ETH_MAC_IT_TST)){
		g_TargetTimeReached = 1;
	}
#endif

    if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_R )){
		while (ETH_CheckFrameReceived())   {// check if any packet received
#if (ETHIF_ROLE == SIMPLE_ETH)
			//printf("---EthIRQ\r\n");

			//Appropriate Handler
	#if (PROJ_FOR == PROJ_FOR_EDU)
			stm107_EthReceivePacket();//ethernetif_low_level_input_VerySimple();//ethernetif_input_VerySimple(); //
	#elif (PROJ_FOR == PROJ_FOR_RSTP)
			rstp_eth_input(g_rstp_Rx_Buff);
	#endif

#else
			LwIP_Pkt_Handle(); //avb_ethernetif_input()//move FIFO into pbuf, and handles it.
#endif
		}
        ETH_DMAClearITPendingBit( ETH_DMA_IT_R );    //Clear the Eth DMA Rx IT pending bits
    }
    if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_T ) ){
        ETH_DMAClearITPendingBit( ETH_DMA_IT_T);
    }
    if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_NIS ) ){ //Normal interrupt summary
        ETH_DMAClearITPendingBit( ETH_DMA_IT_NIS);
    }

    //ETH_DMAClearITPendingBit( ETH_DMA_IT_R | ETH_DMA_IT_T | ETH_DMA_IT_NIS);    // Clear the Eth DMA Rx IT pending bits
    //Bit 16 NIS: Normal interrupt summary. The normal interrupt summary bit value is the logical OR of the following when the
	//	corresponding interrupt bits are enabled in the ETH_DMAIER register:
	//	– ETH_DMASR [0]: Transmit interrupt
	//	– ETH_DMASR [2]: Transmit buffer unavailable
	//	– ETH_DMASR [6]: Receive interrupt
	//	– ETH_DMASR [14]: Early receive interrupt
	//	Only unmasked bits affect the normal interrupt summary bit. This is a sticky bit and it must be cleared (by writing a 1 to this bit) each time a corresponding
	//	Bit 16 is only reset in ETH_IRQHandler and ETH_IRQHandler never being executed.
    //

    //if( SET == ETH_GetDMAITStatus( ETH_DMA_IT_TBU ) ) {//YOON
    	//ETH_SetDMATxDescOwnBit(gp_DMATxDescToSet);
        //ETH_DMAClearITPendingBit( ETH_DMA_IT_TBU);
        //printf("---TBU_IRQ");
    //}

}
*/


//=====================================================Reference Only =============
#if (PHYCHIP == DP83848)

void ETH_GPIO_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable GPIO clocks */
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOE,  ENABLE);

   //Enable SysCfg Clock
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure MCO (PA8) */ //Someone reports the MCO should be used even if not used for Ethernet. ??? Really? And PA8 should be NC.
  //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  //GPIO_Init(GPIOA, &GPIO_InitStructure);

#if (MII_RMII == MII_MODE)
 #ifdef USE_MCO1_FOR_PHY_CLOCK_SRC
  /* Output HSE clock (25MHz) on MCO pin (PA8) to clock the PHY */
  RCC_MCO1Config(RCC_MCO1Source_HSE, RCC_MCO1Div_1);
	printf("***Using MCO1 25MHz Output ***\r\n");
 #endif /* USE_MCO1_FOR_PHY_CLOCK_SRC */
  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_MII); ////0 = MII/ 1= RMII
#else
  /* Output PLL clock divided by 2 (50MHz) on MCO pin (PA8) to clock the PHY */
  //RCC_MCO1Config(RCC_MCO1Source_PLLCLK, RCC_MCO1Div_2);
  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_RMII);
#endif

  /* Configure nRESETPHY (PC8). Issue nPHY_RESET */
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
   GPIO_Init(GPIOC, &GPIO_InitStructure);

   //SET MII mode while in RESET ????
   GPIO_ResetBits(GPIOC, GPIO_Pin_8);

  delayms(800);
  GPIO_SetBits(GPIOC, GPIO_Pin_8); //nRESET_PHY TO HIGH
  delayms(10);

/* Ethernet pins configuration (YOON)************************************************/
   /*
        ETH_MDIO -------------------------> PA2 +
        ETH_MDC --------------------------> PC1 +
        ETH_PPS_OUT ----------------------> PB5 --- STM32 PPS
        ETH_MII_CRS ----------------------> PA0  -- Dont cared by MAC for Full Duplex Mode.
        ETH_MII_COL ----------------------> PA3  -- Dont cared by MAC for Full Duplex Mode.
        ETH_MII_RX_ER --------------------> PB10
        ETH_MII_RXD2 ---------------------> PB0
        ETH_MII_RXD3 ---------------------> PB1
        ETH_MII_TX_CLK -------------------> PC3 +
        ETH_MII_TXD2 ---------------------> PC2 +
        ETH_MII_TXD3 ---------------------> PE2 //PB8 +
        ETH_MII_RX_CLK/ETH_RMII_REF_CLK---> PA1 +
        ETH_MII_RX_DV/ETH_RMII_CRS_DV ----> PA7 +
        ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4 +
        ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5 +
        ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PB11
        ETH_MII_TXD0/ETH_RMII_TXD0 -------> PB12
        ETH_MII_TXD1/ETH_RMII_TXD1 -------> PB13

        nPHYRESET ------------------------> PC8

 	 	 // Configure PA0, PA1, PA2, PA3, and PA7
  	  	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
  	  	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //?? NO GPIO_OType_AF
  	  	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  	  	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  	  	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_7;
  	  	  GPIO_Init(GPIOA, &GPIO_InitStructure);

  	  	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_ETH);
  	  	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_ETH);
  	  	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_ETH);
  	  	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_ETH);
  	  	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_ETH); //AF11

