kmkim036/Auto-Headlight-Control-System/src/example/yLib/eth/stm32f1x7_eth_bsp.c
  //Select MII mode : Setting mode is allowed under reset or before enabling MAC clocks.
  //RCC_AHB1PeriphResetCmd(RCC_AHB1Periph_ETH_MAC, ENABLE);

#ifdef USE_MCO1_FOR_PHY_CLOCK_SRC
 //#error using USE_MCO1_FOR_PHY_CLOCK_SRC !!!
   /* Output HSE clock (25MHz) on MCO pin (PA8) to clock the PHY */
   RCC_MCO1Config(RCC_MCO1Source_HSE, RCC_MCO1Div_1); //--HOWEVER WE DO NOT USE FOR BROADR-REACH MODULE.
	printf("***Using MCO1 25MHz Output ***\r\n");
#endif /* USE_MCO1_FOR_PHY_CLOCK_SRC */
  //Select MII mode : Setting mode is allowed under reset or before enabling MAC clocks.
  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_MII); //0 = MII/ 1= RMII


#elif (MII_RMII == RMII_MODE)  /* Mode RMII with STM324xG-EVAL */
#error using RMII_MODE !!!!!
  /* Output PLL clock divided by 2 (50MHz) on MCO pin (PA8) to clock the PHY */
  //RCC_MCO1Config(RCC_MCO1Source_PLLCLK, RCC_MCO1Div_2);
  SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_RMII);
#endif

  delayms(800);
  GPIO_SetBits(GPIOC, GPIO_Pin_8); //nRESET_PHY TO HIGH

	  //RCC_AHB1PeriphResetCmd(RCC_AHB1Periph_ETH_MAC, DISABLE);

  delayms(10);

/* Ethernet pins configuration (YOON)************************************************/
   /*
        ETH_MDIO -------------------------> PA2 +
        ETH_MDC --------------------------> PC1 +
        ETH_PPS_OUT ----------------------> PB5 --- STM32 PPS
        -ETH_MII_CRS ----------------------> PA0  -- Dont cared by MAC for Full Duplex Mode.
        -ETH_MII_COL ----------------------> PA3  -- Dont cared by MAC for Full Duplex Mode.
        -ETH_MII_RX_ER --------------------> PB10
        ETH_MII_RXD2 ---------------------> PB0
        ETH_MII_RXD3 ---------------------> PB1
        ETH_MII_TX_CLK -------------------> PC3 +
        ETH_MII_TXD2 ---------------------> PC2 +
        ETH_MII_TXD3 ---------------------> PE2 //PB8 +
        ETH_MII_RX_CLK/ETH_RMII_REF_CLK---> PA1 +
        ETH_MII_RX_DV/ETH_RMII_CRS_DV ----> PA7 +
        ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4 +
        ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5 +
        ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PB11
        ETH_MII_TXD0/ETH_RMII_TXD0 -------> PB12
        ETH_MII_TXD1/ETH_RMII_TXD1 -------> PB13

        -nPHYRESET ------------------------> PC8 (Optional)
                                                  */

  /* Enable GPIOs clocks for Ethernet */
  /* Configure PA0, PA1, PA2, PA3, and PA7 */
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //?? NO GPIO_OType_AF
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_7;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_ETH); //AF11

  /* Configure PB0,PB1,PB5,PB10,PB11,PB12 and PB13 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 |GPIO_Pin_1 | GPIO_Pin_5 | GPIO_Pin_10 | GPIO_Pin_11 |  GPIO_Pin_13 | GPIO_Pin_12 ;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_PinAFConfig(GPIOB, GPIO_PinSource0, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource1, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource5, GPIO_AF_ETH); //PPS - The PPS output is enabled through a GPIO alternate function. (GPIO_AFR register).
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource12, GPIO_AF_ETH);

  /* Configure PC1, PC2, PC3, PC4 and PC5 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource1, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource2, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource3, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource4, GPIO_AF_ETH);
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_ETH);

  /* Configure PE2 (for TXD3) */
  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_2;
  GPIO_Init(GPIOE, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource2, GPIO_AF_ETH);

}


void ETH_BROADR_BSP_Config(void)
{
	int i;
	uint16_t ret;
	unsigned int result;
	    /***************************************************************************
	    NOTE:
	         When using Systick to manage the delay in Ethernet driver, the Systick
	         must be configured before Ethernet initialization and, the interrupt
	         priority should be the highest one.
	  *****************************************************************************/

  // Configure the GPIO ports for ethernet pins
  ETH_GPIO_Config(); //Setup GPIO and MII Mode before MAC Clocking.
  printf("ETH_GPIO_Config...ok\r\n");
  delayms(10);

  // Config NVIC for Ethernet
  ETH_NVIC_Config();
  printf("ETH_NVIC_Config...ok\r\n");
  delayms(10);

  //Start MAC Clocking
  //RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx | RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx | RCC_AHB1Periph_ETH_MAC_Rx | RCC_AHB1Periph_ETH_MAC_PTP, ENABLE);
  //add RCC_AHB1Periph_ETH_MAC_PTP. YOON   if user wants to use PTP option (in 'stm32f4x7_eth_bsp.c')

  //++++Setup Normal MII Mode of BroadR PHY++++++
  y811BroadR_SetupNormalMiiMode(); //LiteMode
  delayms(10);

  // Configure the Ethernet MAC/DMA
  ETH_MACDMA_Config();
  printf("ETH_MACDMA_Config...ok\r\n");
  printf("EthInitStatus: %d\r\n",gEthInitStatus);
  delayms(10);
  if (gEthInitStatus == 0) {
    while(1){
    	printf("EthInitStatus=0 --> Error\r\n"); delayms(100);
    }
  }
  printf("ETH_BSP_Config --> PASSED\r\n");

  //==== BroadR Specific ===================================
  // Read PHY status register: Get Ethernet link status
  if(ETH_ReadPHYRegister(BROADR_PHY_ADDRESS, 0x01) & 0x04)  { //LRE Status Register(01:2) == 1-> Link UP
	  EthLinkStatus |= ETH_LINK_FLAG;  //EthStatus |= ETH_LINK_FLAG;
  }
  // Configure the PHY to generate an interrupt on change of link status : NOT SUPPORT ON BR89810 PHY --YOON
  //Eth_Link_PHYITConfig(BROADR_PHY_ADDRESS);  //Eth_Link_PHYITConfig(0x18);//IP101A_PHY_ADDRESS);//KSZ8051_PHY_ADDRESS);
  // Configure the EXTI for Ethernet link status.
  //Eth_Link_EXTIConfig();

  //For AN
  //ETH_WritePHYRegister(yPHYADDR, 0, 0x1000);//0x1200	//UARTprintf(">AutoNeg.\r\n");
  //For FORCED MASTER
  //ETH_WritePHYRegister(BROADR_PHY_ADDRESS, 0, 0x0208);
  //printf(">Forced Master\r\n");
  //delayms(10);

  //Walk through PHY Registers
	for(i=0;i<16;i++){
		ret = ETH_ReadPHYRegister(BROADR_PHY_ADDRESS, i);
		printf("ret(%d)=0x%04x\r\n",i,ret);
		delayms(10);
	}
}

