kmkim036/Auto-Headlight-Control-System/src/example/yLib/eth/stm32f1x7_eth_bsp.c
void y811BroadR_SetupNormalMiiMode(){
	u32 ret, result;


	ret = ETH_WritePHYRegister(BROADR_PHY_ADDRESS, 0x18, 0xf067);//	mdio_write(0x18, 0x18, 0xf067); //GMII/MII Mode Setup (use Shadow 7)
	delayms(10);
	if(ret == ETH_SUCCESS) printf("Suc 1\n");
	ETH_WritePHYRegister(BROADR_PHY_ADDRESS, 0x1c, 0xac01); //3.3V MII Pad Setup
	delayms(10);
	if(ret == ETH_SUCCESS) printf("Suc 2\n");
	ETH_WritePHYRegister(BROADR_PHY_ADDRESS, 0x17, 0x0f0e); //select expansion register of 0x0e
	delayms(10);
	if(ret == ETH_SUCCESS) printf("Suc 3\n");
	ETH_WritePHYRegister(BROADR_PHY_ADDRESS, 0x15, 0x0800); //MII-Lite Mode Setup
	delayms(10);
	if(ret == ETH_SUCCESS) printf("Suc 4\n");
}
#endif

#if 0
//Historical
void ETH_SimpleOrSwitchPHY_BSP_Config(unsigned char PhyAddr)
{
	int i;
	uint16_t retv;

  // Configure the GPIO ports for ethernet pins
#if (SWITCH_ID == SWITCH_KSZ8794)
  ETH_GPIO_Config_WO_MDIOMDC(); //Setup GPIO and MII Mode with SPI before MAC Clocking.
#else
  ETH_GPIO_Config(); 			//Setup GPIO and MII Mode before MAC Clocking.
#endif
  printf("ETH_GPIO_Config...ok \r\n");
  delayms(10);

  // Config NVIC for Ethernet
  ETH_NVIC_Config();
  printf("ETH_NVIC_Config...ok \r\n");
  delayms(10);

  //Start MAC Clocking -- will do in ETH_MACDMA_Config()
  //RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx | RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);
  //RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx | RCC_AHB1Periph_ETH_MAC_Rx | RCC_AHB1Periph_ETH_MAC_PTP, ENABLE);
  //add RCC_AHB1Periph_ETH_MAC_PTP. YOON   if user wants to use PTP option (in 'stm32f4x7_eth_bsp.c')

  delayms(10);

  // Configure the Ethernet MAC/DMA
  ETH_MACDMA_Config(PhyAddr);//BROADR_PHY_ADDRESS);

  printf("ETH_MACDMA_Config...ok \r\n");
  printf("EthInitStatus: %d\r\n",gEthInitStatus);
  delayms(10);

  if (gEthInitStatus == 0) {
    while(1){
    	printf("EthInitStatus=0 --> Error \r\n"); delayms(100);
    }
  }
  printf("EthInitStatus=OK\r\n");

  //==== Get PHY Product ID
    // Read PHY ID register2 and 3: Should be 0x0180 and 0xdc48
  retv = ETH_ReadPHYRegister(PhyAddr, 0x02);
  printf("PHYID Reg2 = 0x%04x and ",retv);

  retv = ETH_ReadPHYRegister(PhyAddr, 0x03);
  printf("PHYID Reg3 = 0x%04x \r\n",retv);


  if(MII_RMII == MII_MODE){
	  printf("ETH_BSP_Config --> MII\r\n");
  }else
	  printf("ETH_BSP_Config --> RMII\r\n");
  printf("ETH_BSP_Config --> PASSED\r\n");
  //Walk through PHY Registers with SPI or I2C
/*	for(i=0;i<16;i++){
		retv = ETH_ReadPHYRegister(IP101A_PHY_ADDRESS, i);
		printf("ret(%d)=0x%04x\r\n",i,retv);
		delayms(10);
	}
*/
}

#endif
#endif //PROCESSOR
/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
#if (ETHIF_ROLE == SIMPLE_ETH)
/*
void ethernetif_low_level_input_VerySimple()
{

  unsigned short len;
  int l =0;
  FrameTypeDef frame;
  unsigned char *buf;
  uint32_t i=0;
  __IO ETH_DMADESCTypeDef *DMARxNextDesc;
  char str[10];

  // get received frame
  frame = ETH_Get_Received_Frame_byPollingMethod();

  len = frame.length;
  buf = (unsigned char *)frame.buffer;

  sprintf(str,"R>Type=%02x%02x(%d)",buf[12], buf[13],rxnum);
  printf("%s\r\n", str);
  //stmOzOLED_printString(str,0,4,16);
  rxnum++;
  // Release descriptors to DMA
  // Check if frame with multiple DMA buffer segments
  if (gp_DMA_RX_FRAME_infos->Seg_Count > 1)  {
    DMARxNextDesc = gp_DMA_RX_FRAME_infos->FS_Rx_Desc;
  }else {
    DMARxNextDesc = frame.descriptor;
  }

  // Set Own bit in Rx descriptors: gives the buffers back to DMA
  for (i=0; i<gp_DMA_RX_FRAME_infos->Seg_Count; i++) {
    DMARxNextDesc->Status = ETH_DMARxDesc_OWN;
    DMARxNextDesc = (ETH_DMADESCTypeDef *)(DMARxNextDesc->Buffer2NextDescAddr);
  }

  // Clear Segment_Count
  gp_DMA_RX_FRAME_infos->Seg_Count =0;

  //When Rx Buffer unavailable flag is set: clear it and resume reception
  if ((ETH->DMASR & ETH_DMASR_RBUS) != (u32)RESET) {
    // Clear RBUS ETHERNET DMA flag
    ETH->DMASR = ETH_DMASR_RBUS;
    // Resume DMA reception
    ETH->DMARPDR = 0;
  }

}
  */
#endif


